# Города
# Дан список стран и городов каждой страны. Затем даны названия городов. Для
# каждого города укажите, в какой стране он находится.
# Входные данные
# Программа получает на вход количество стран N. Далее идет N строк, каждая
# строка начинается с названия страны, затем идут названия городов этой страны.
# В следующей строке записано число M, далее идут M запросов — названия
#  каких-то M городов, перечисленных выше.
# Выходные данные
# Для каждого из запроса выведите название страны, в котором находится данный
# город.

# num_input = int(input('Введите количество стран: '))
# count = 0
# list_country = []
#
# while count < num_input:
#     list_country.append(input('Введите страну и ее города: '))
#     count += 1

list_country = "бел гомель минск горки"
a = list_country.split()
b = {}
for i in a:
    b[i] =



print(a[0])

